---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RunInvalidSketch
source: html/c882b12a-5a47-0834-5db8-2c53444ab676.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RunInvalidSketch Property

Invalid sketch, can't create run by this sketch

## Syntax (C#)
```csharp
public static FailureDefinitionId RunInvalidSketch { get; }
```